#Выведите на экран строку 2 times, полученную из числа 2 и строки times, используя преобразования типов и конкатенацию:

#2 times

one_lines = 2
two_lines = 'times'
print(str(one_lines), two_lines)
