#Реализуйте функцию print_motto(), которая печатает на экран фразу Winter is coming:

#print_motto()  # => Winter is coming
#Важное замечание! В задачах, в которых нужно реализовать функцию, эту функцию вызывать не нужно. Вызывать функцию будут автоматизированные тесты, которые проверяют ее работоспособность. Пример с вызовом выше показан, чтобы вы понимали, как ваша функция будет использоваться.
def print_motto():
    print('Winter is coming')
print_motto()
