#Определите функцию say_hurray_three_times(), которая возвращает строку hurray! hurray! hurray!

# Вызов функции
#result = say_hurray_three_times()
#print(result)  # => hurray! hurray! hurray!
#Вам нужно только определить функцию, вызывать ее не нужно. Вызов функции будет происходить в тестах при проверке решения

def say_hurray_three_times():
    result = 'hurray! hurray! hurray!'
    print(result)
    return result
say_hurray_three_times()
