#Функция type() позволяет определить тип передаваемого аргумента. Название типа возвращается в виде строки. Например, вызов type(10) вернёт строку <class 'int'>. Int — это сокращение от integer, то есть «целое число».

#Выведите на экран тип значения переменной motto.

motto = 'Family, Duty, Honor'
print(type(motto))