#Найдите в программе необъявленную переменную и объявите ее, присвоив ей значение Dragon

family = 'Targaryen'
pet = "Dragon"
# BEGIN (write your solution here)

# END

print(family)
print(' and ')
print(pet)